In [133]:
import pandas as pd

In [134]:
import matplotlib.pyplot as plt

In [135]:
dados = pd.read_csv('C:/xampp/htdocs/phpprog/Uni_Maravilhas_Final/Uni_Fase1dados.csv')

In [136]:
dados.head() #initially the data was sep by semicolon which produced flawed date

#realized that it was not being delinated by comma,changed the error.  working fine now

,nr_aluno,nome,apelido,curso,media_entrada,curso_concluido,media_final
0,20216,Joana,Castelo,Comunicação,20,1,12
1,200315,Anne,Morais,Psicologia,14,1,16
2,200321,Pedro,Castelo,Informática,10,1,19
3,200326,Patrícia,da Silva,Psicologia,20,1,10
4,200331,Beatriz,Castelo,Comunicação,19,1,12

In [137]:
dados['media_entrada']

0       20
1       14
2       10
3       20
4       19
        ..
1712    15
1713    18
1714    14
1715    10
1716    13
Name: media_entrada, Length: 1717, dtype: int64

In [138]:
dados['media_final']  # to see the scores of the media final

0       12
1       16
2       19
3       10
4       12
        ..
1712    16
1713    10
1714    16
1715    20
1716    20
Name: media_final, Length: 1717, dtype: int64

In [139]:
dados['media_entrada'].min()  # curious about the range of the entry grades

10

In [140]:
dados['media_final'].min()

10

In [141]:
dados['media_entrada'].max() # curious about the range of the exiting grades
# Initially it was that the max is above 20. I am since removed this faulty data

20

In [195]:
dados['media_final'].max()  # there was a slight decrease in the exiting grades in terms of the max grade

20

In [196]:
cols = ['curso','media_entrada', 'media_final']  #interesting to see these col side by side
dados[cols]

            curso  media_entrada  media_final
0     Comunicação             20           12
1      Psicologia             14           16
2     Informática             10           19
3      Psicologia             20           10
4     Comunicação             19           12
...           ...            ...          ...
1712   Psicologia             15           16
1713   Psicologia             18           10
1714  Informática             14           16
1715   Psicologia             10           20
1716   Psicologia             13           20

[1717 rows x 3 columns]

In [197]:
type(dados)

pandas.core.frame.DataFrame

In [198]:
dados_end = dados.tail(2)  # see the last two of the db
dados_end

,nr_aluno,nome,apelido,curso,media_entrada,curso_concluido,media_final
1715,2022165224,Jorge,Pires,Psicologia,10,1,20
1716,2022174449,Michaelangelo,Silva,Psicologia,13,1,20

In [199]:
dados.dtypes #series, index is not a col.  It is a label

nr_aluno            int64
nome               object
apelido            object
curso              object
media_entrada       int64
curso_concluido     int64
media_final         int64
dtype: object

In [201]:
dados.shape  #this is the same as sql

(1717, 7)

In [202]:
dados.index

RangeIndex(start=0, stop=1717, step=1)

In [203]:
dados.columns

Index(['nr_aluno', 'nome', 'apelido', 'curso', 'media_entrada',
       'curso_concluido', 'media_final'],
      dtype='object')

In [204]:
dados.set_index('nr_aluno')  # change index to student ID to take out unnecessary numbers

,nome,apelido,curso,media_entrada,curso_concluido,media_final
nr_aluno,,,,,,
20216,Joana,Castelo,Comunicação,20,1,12
200315,Anne,Morais,Psicologia,14,1,16
200321,Pedro,Castelo,Informática,10,1,19
200326,Patrícia,da Silva,Psicologia,20,1,10
200331,Beatriz,Castelo,Comunicação,19,1,12
...,...,...,...,...,...,...
2022146725,Rita,Cintra,Psicologia,15,1,16
2022150947,Christos,Machado,Psicologia,18,1,10
2022165143,Pedro,Pires,Informática,14,1,16
2022165224,Jorge,Pires,Psicologia,10,1,20
2022174449,Michaelangelo,Silva,Psicologia,13,1,20

In [205]:
group_df = dados.groupby("curso")

In [206]:
mean_df = group_df.mean().round(0)

In [207]:
print(mean_df)  
#it is clear that there is not a correlation between the entering grades and final grades of the course

               nr_aluno  media_entrada  curso_concluido  media_final
curso
Comunicação  63765375.0           15.0              1.0         15.0
Informática  74797905.0           15.0              1.0         15.0
Psicologia   72492398.0           15.0              1.0         15.0

In [208]:
print("The mean of the entering gpa = ",dados['media_entrada'].mean().round(0))  # look at mean to answer the inquiry

The mean of the entering gpa =  15.0

In [209]:
print("The mean of the exiting gpa = ",dados['media_final'].mean().round(0))  #look at mean at final grade

The mean of the exiting gpa =  15.0

In [210]:
data = pd.read_csv('C:/xampp/htdocs/phpprog/Uni_Maravilhas_Final/Uni_dadosErrados.csv')
# imported the csv file that I created with the flawed data to do some analysis
#converted the text file to csv

In [211]:
dados2.head()  #checking to see that the data is in fact the flawed data

,nr_aluno,nome,apelido,curso,media_entrada,curso_concluido,media_final
0,200722,Catarina,da Silva,Psicologia,13,0,NaN
1,200739,Alice,Pires,Psicologia,17,0,NaN
2,202245,Rui,Pires,Informática,10,1,-2.0
3,2003485,Alice,Pires,Psicologia,13,0,NaN
4,2003504,Beatriz,Laranjeira,Comunicação,12,0,NaN

In [212]:
dados2.shape  #shape is consistent with csv file

(33, 7)

In [213]:
dados2.tail()  #double check and it is ok

,nr_aluno,nome,apelido,curso,media_entrada,curso_concluido,media_final
28,20211328,Ana,Sampaio,Informática,12,1,-1.0
29,20211394,Bruno,Cintra,Medicina Veterinária,18,1,13.0
30,20211664,Beatriz,Capicua,Informática,16,0,NaN
31,20221087,Rodrigo,Morais,Informática,16,0,NaN
32,20221456,Lucas,Silva,Informática,18,1,-1.0

In [215]:
df=dados2.query("curso_concluido == 0")  #curious how many of the faulty data did not finish the course

In [219]:
df.shape  #it appears that about half of the faulty data was from students who did not finish the course

(15, 7)

In [220]:
df

,nr_aluno,nome,apelido,curso,media_entrada,curso_concluido,media_final
0,200722,Catarina,da Silva,Psicologia,13,0,NaN
1,200739,Alice,Pires,Psicologia,17,0,NaN
3,2003485,Alice,Pires,Psicologia,13,0,NaN
4,2003504,Beatriz,Laranjeira,Comunicação,12,0,NaN
5,2003821,Nuno,Laranjeira,Psicologia,16,0,NaN
6,2007103,Catarina,Castelo,Informática,14,0,NaN
13,2020537,Maria João,Sampaio,Comunicação,12,0,NaN
16,2021847,Patrícia,Pires,Psicologia,10,0,NaN
17,2022848,Carla,Pereira,Psicologia,17,0,NaN
20,20031072,Nuno,Pires,Comunicação,14,0,NaN
22,20191494,Joana,Castelo,Psicologia,15,0,NaN
23,20191750,Anne,Cintra,Comunicação,12,0,NaN
26,20211052,Raquel,Castelo,Comunicação,16,0,NaN
30,20211664,Beatriz,Capicua,Informática,16,0,NaN
31,20221087,Rodrigo,Morais,Informática,16,0,NaN

In [221]:
dados2['curso'].value_counts()  #wanted to determine which major were in the flawed data

Psicologia              9
Informática             9
Comunicação             7
Medicina Veterinária    4
Desconhecido            2
Cintilar                1
Má Vida                 1
Name: curso, dtype: int64

In [222]:
dadosFase2 = pd.read_csv('C:/xampp/htdocs/phpprog/Uni_Maravilhas_Final/Uni_Fase2dados.csv')

In [223]:
dadosFase2.head()

,nr_aluno,nome,apelido,curso,media_entrada,curso_concluido,media_final,curso_origem
0,20031002,Diana,Pereira,Psicologia,12,1,20,Geral
1,20031013,Nuno,Capicua,Informática,12,1,19,Geral
2,20031015,Rita,Machado,Comunicação,20,1,13,Geral
3,2003102,Raquel,Laranjeira,Informática,18,1,12,Profissional
4,20031022,Patrícia,Castelo,Psicologia,15,1,14,Geral

In [225]:
group_df2 = dadosFase2.groupby("curso_origem")

In [226]:
mean_df2 = group_df2.mean().round(0)

In [227]:
#shows that there is a correlation between those students with prof and the program. They did significantly better
print(mean_df2)

                nr_aluno  media_entrada  curso_concluido  media_final
curso_origem
Geral         73366065.0           16.0              1.0         14.0
Profissional  67400211.0           14.0              1.0         16.0